#include "Time.h"
#include "func.h"

/*Створити клас TTime, який представляє час в межах доби і містить методи для його збільшення / зменшення на вказану величину та обчислення часу,
що залишився до завершення доби.На основі цього класу створити класи - нащадки TTime12("ГГ:ХХ:СС") та TTime24("ГГ:ХХ:СС"),
які задають час 12 - годинному та 24 - годинному форматі.Створити n об'єктів часу в 12-годинному форматі та m об'єктів часу в 24 - годинному форматі.
Усі об'єктів часу в 12- годинному форматі зменшити на 5 секунд, а інші - збільшити на 15 хвилин. 
Визначити найменший час, що залишився до завершення доби.*/

int main() 
{
    work();
}